artillery-scripts/io-test-1-basic.yaml
config:
  target: "http://35.201.140.126"
  phases:
    - duration: 333
      arrivalRate: 3
      name: Warm up
  payload:
    path: "./dataset/ratings_test_1k.csv"
    fields:
      - "content"
scenarios:
  - name: "just post content"
    flow:
      - post:
          url: "/post"
          json:
            content: "{{ content }}"